MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA6M3AF3CFB/mcu.h
 #define R_ACMPHS0                ((R_ACMPHS0_Type *) R_ACMPHS0_BASE)
 #define R_ACMPHS1                ((R_ACMPHS0_Type *) R_ACMPHS1_BASE)
 #define R_ACMPHS2                ((R_ACMPHS0_Type *) R_ACMPHS2_BASE)
 #define R_ACMPHS3                ((R_ACMPHS0_Type *) R_ACMPHS3_BASE)
 #define R_ACMPHS4                ((R_ACMPHS0_Type *) R_ACMPHS4_BASE)
 #define R_ACMPHS5                ((R_ACMPHS0_Type *) R_ACMPHS5_BASE)
 #define R_ADC0                   ((R_ADC0_Type *) R_ADC0_BASE)
 #define R_ADC1                   ((R_ADC0_Type *) R_ADC1_BASE)
 #define R_BUS                    ((R_BUS_Type *) R_BUS_BASE)
 #define R_CAC                    ((R_CAC_Type *) R_CAC_BASE)
 #define R_CAN0                   ((R_CAN0_Type *) R_CAN0_BASE)
 #define R_CAN1                   ((R_CAN0_Type *) R_CAN1_BASE)
 #define R_CRC                    ((R_CRC_Type *) R_CRC_BASE)
 #define R_CTSU                   ((R_CTSU_Type *) R_CTSU_BASE)
 #define R_DAC                    ((R_DAC_Type *) R_DAC_BASE)
 #define R_DEBUG                  ((R_DEBUG_Type *) R_DEBUG_BASE)
 #define R_DMA                    ((R_DMA_Type *) R_DMA_BASE)
 #define R_DMAC0                  ((R_DMAC0_Type *) R_DMAC0_BASE)
 #define R_DMAC1                  ((R_DMAC0_Type *) R_DMAC1_BASE)
 #define R_DMAC2                  ((R_DMAC0_Type *) R_DMAC2_BASE)
 #define R_DMAC3                  ((R_DMAC0_Type *) R_DMAC3_BASE)
 #define R_DMAC4                  ((R_DMAC0_Type *) R_DMAC4_BASE)
 #define R_DMAC5                  ((R_DMAC0_Type *) R_DMAC5_BASE)
 #define R_DMAC6                  ((R_DMAC0_Type *) R_DMAC6_BASE)
 #define R_DMAC7                  ((R_DMAC0_Type *) R_DMAC7_BASE)
 #define R_DOC                    ((R_DOC_Type *) R_DOC_BASE)
 #define R_DRW                    ((R_DRW_Type *) R_DRW_BASE)
 #define R_DTC                    ((R_DTC_Type *) R_DTC_BASE)
 #define R_ELC                    ((R_ELC_Type *) R_ELC_BASE)
 #define R_ETHERC0                ((R_ETHERC0_Type *) R_ETHERC0_BASE)
 #define R_ETHERC_EDMAC           ((R_ETHERC_EDMAC_Type *) R_ETHERC_EDMAC_BASE)
 #define R_PTP_EDMAC              ((R_ETHERC_EDMAC_Type *) R_PTP_EDMAC_BASE)
 #define R_ETHERC_EPTPC           ((R_ETHERC_EPTPC_Type *) R_ETHERC_EPTPC_BASE)
 #define R_ETHERC_EPTPC1          ((R_ETHERC_EPTPC_Type *) R_ETHERC_EPTPC1_BASE)
 #define R_ETHERC_EPTPC_CFG       ((R_ETHERC_EPTPC_CFG_Type *) R_ETHERC_EPTPC_CFG_BASE)
 #define R_ETHERC_EPTPC_COMMON    ((R_ETHERC_EPTPC_COMMON_Type *) R_ETHERC_EPTPC_COMMON_BASE)
 #define R_FACI_HP_CMD            ((R_FACI_HP_CMD_Type *) R_FACI_HP_CMD_BASE)
 #define R_FACI_HP                ((R_FACI_HP_Type *) R_FACI_HP_BASE)
 #define R_FCACHE                 ((R_FCACHE_Type *) R_FCACHE_BASE)
 #define R_GLCDC                  ((R_GLCDC_Type *) R_GLCDC_BASE)
 #define R_GPT0                   ((R_GPT0_Type *) R_GPT0_BASE)
 #define R_GPT1                   ((R_GPT0_Type *) R_GPT1_BASE)
 #define R_GPT2                   ((R_GPT0_Type *) R_GPT2_BASE)
 #define R_GPT3                   ((R_GPT0_Type *) R_GPT3_BASE)
 #define R_GPT4                   ((R_GPT0_Type *) R_GPT4_BASE)
 #define R_GPT5                   ((R_GPT0_Type *) R_GPT5_BASE)
 #define R_GPT6                   ((R_GPT0_Type *) R_GPT6_BASE)
 #define R_GPT7                   ((R_GPT0_Type *) R_GPT7_BASE)
 #define R_GPT8                   ((R_GPT0_Type *) R_GPT8_BASE)
 #define R_GPT9                   ((R_GPT0_Type *) R_GPT9_BASE)
 #define R_GPT10                  ((R_GPT0_Type *) R_GPT10_BASE)
 #define R_GPT11                  ((R_GPT0_Type *) R_GPT11_BASE)
 #define R_GPT12                  ((R_GPT0_Type *) R_GPT12_BASE)
 #define R_GPT13                  ((R_GPT0_Type *) R_GPT13_BASE)
 #define R_GPT_ODC                ((R_GPT_ODC_Type *) R_GPT_ODC_BASE)
 #define R_GPT_OPS                ((R_GPT_OPS_Type *) R_GPT_OPS_BASE)
 #define R_GPT_POEG0              ((R_GPT_POEG0_Type *) R_GPT_POEG0_BASE)
 #define R_GPT_POEG1              ((R_GPT_POEG0_Type *) R_GPT_POEG1_BASE)
 #define R_GPT_POEG2              ((R_GPT_POEG0_Type *) R_GPT_POEG2_BASE)
 #define R_GPT_POEG3              ((R_GPT_POEG0_Type *) R_GPT_POEG3_BASE)
 #define R_ICU                    ((R_ICU_Type *) R_ICU_BASE)
 #define R_IIC0                   ((R_IIC0_Type *) R_IIC0_BASE)
 #define R_IIC1                   ((R_IIC0_Type *) R_IIC1_BASE)
 #define R_IIC2                   ((R_IIC0_Type *) R_IIC2_BASE)
 #define R_IRDA                   ((R_IRDA_Type *) R_IRDA_BASE)
 #define R_IWDT                   ((R_IWDT_Type *) R_IWDT_BASE)
 #define R_JPEG                   ((R_JPEG_Type *) R_JPEG_BASE)
 #define R_KINT                   ((R_KINT_Type *) R_KINT_BASE)
 #define R_MMF                    ((R_MMF_Type *) R_MMF_BASE)
 #define R_MPU_MMPU               ((R_MPU_MMPU_Type *) R_MPU_MMPU_BASE)
 #define R_MPU_SMPU               ((R_MPU_SMPU_Type *) R_MPU_SMPU_BASE)
 #define R_MPU_SPMON              ((R_MPU_SPMON_Type *) R_MPU_SPMON_BASE)
 #define R_MSTP                   ((R_MSTP_Type *) R_MSTP_BASE)
 #define R_PDC                    ((R_PDC_Type *) R_PDC_BASE)
 #define R_PORT0                  ((R_PORT0_Type *) R_PORT0_BASE)
 #define R_PORT1                  ((R_PORT0_Type *) R_PORT1_BASE)
 #define R_PORT2                  ((R_PORT0_Type *) R_PORT2_BASE)
 #define R_PORT3                  ((R_PORT0_Type *) R_PORT3_BASE)
 #define R_PORT4                  ((R_PORT0_Type *) R_PORT4_BASE)
 #define R_PORT5                  ((R_PORT0_Type *) R_PORT5_BASE)
 #define R_PORT6                  ((R_PORT0_Type *) R_PORT6_BASE)
 #define R_PORT7                  ((R_PORT0_Type *) R_PORT7_BASE)
 #define R_PORT8                  ((R_PORT0_Type *) R_PORT8_BASE)
 #define R_PORT9                  ((R_PORT0_Type *) R_PORT9_BASE)
 #define R_PORT10                 ((R_PORT0_Type *) R_PORT10_BASE)
 #define R_PORT11                 ((R_PORT0_Type *) R_PORT11_BASE)
 #define R_PORT12                 ((R_PORT0_Type *) R_PORT12_BASE)
 #define R_PORT13                 ((R_PORT0_Type *) R_PORT13_BASE)
 #define R_PORT14                 ((R_PORT0_Type *) R_PORT14_BASE)
 #define R_PFS                    ((R_PFS_Type *) R_PFS_BASE)
 #define R_PMISC                  ((R_PMISC_Type *) R_PMISC_BASE)
 #define R_QSPI                   ((R_QSPI_Type *) R_QSPI_BASE)
 #define R_RTC                    ((R_RTC_Type *) R_RTC_BASE)
 #define R_SCI0                   ((R_SCI0_Type *) R_SCI0_BASE)
 #define R_SCI1                   ((R_SCI0_Type *) R_SCI1_BASE)
 #define R_SCI2                   ((R_SCI0_Type *) R_SCI2_BASE)
 #define R_SCI3                   ((R_SCI0_Type *) R_SCI3_BASE)
 #define R_SCI4                   ((R_SCI0_Type *) R_SCI4_BASE)
 #define R_SCI5                   ((R_SCI0_Type *) R_SCI5_BASE)
 #define R_SCI6                   ((R_SCI0_Type *) R_SCI6_BASE)
 #define R_SCI7                   ((R_SCI0_Type *) R_SCI7_BASE)
 #define R_SCI8                   ((R_SCI0_Type *) R_SCI8_BASE)
 #define R_SCI9                   ((R_SCI0_Type *) R_SCI9_BASE)
 #define R_SDHI0                  ((R_SDHI0_Type *) R_SDHI0_BASE)
 #define R_SDHI1                  ((R_SDHI0_Type *) R_SDHI1_BASE)
 #define R_SPI0                   ((R_SPI0_Type *) R_SPI0_BASE)
 #define R_SPI1                   ((R_SPI0_Type *) R_SPI1_BASE)
 #define R_SPI2                   ((R_SPI0_Type *) R_SPI2_BASE)
 #define R_SRAM                   ((R_SRAM_Type *) R_SRAM_BASE)
 #define R_SRC                    ((R_SRC_Type *) R_SRC_BASE)
 #define R_SSI0                   ((R_SSI0_Type *) R_SSI0_BASE)
 #define R_SSI1                   ((R_SSI0_Type *) R_SSI1_BASE)
 #define R_SYSTEM                 ((R_SYSTEM_Type *) R_SYSTEM_BASE)
 #define R_TSN_CAL                ((R_TSN_CAL_Type *) R_TSN_CAL_BASE)
 #define R_TSN_CTRL               ((R_TSN_CTRL_Type *) R_TSN_CTRL_BASE)
 #define R_USB_FS0                ((R_USB_FS0_Type *) R_USB_FS0_BASE)
 #define R_WDT                    ((R_WDT_Type *) R_WDT_BASE)
 #define R_USB_HS0                ((R_USB_HS0_Type *) R_USB_HS0_BASE)
 #define R_AGT0                   ((R_AGTX0_Type *) R_AGTX0_BASE)
 #define R_AGT1                   ((R_AGTX0_Type *) R_AGTX1_BASE)
 #define R_AGT2                   ((R_AGTX0_Type *) R_AGTX2_BASE)
 #define R_AGT3                   ((R_AGTX0_Type *) R_AGTX3_BASE)
 #define R_AGT4                   ((R_AGTX0_Type *) R_AGTX4_BASE)
 #define R_AGT5                   ((R_AGTX0_Type *) R_AGTX5_BASE)
 #define R_AGT6                   ((R_AGTX0_Type *) R_AGTX6_BASE)
 #define R_AGT7                   ((R_AGTX0_Type *) R_AGTX7_BASE)
 #define R_AGT8                   ((R_AGTX0_Type *) R_AGTX8_BASE)
 #define R_AGT9                   ((R_AGTX0_Type *) R_AGTX9_BASE)
 #define R_WDT1                   ((R_WDT_Type *) R_WDT1_BASE)

